{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 7, 1]}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "name": "lstm_1", "go_backwards": true, "use_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "activation": "tanh", "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "units": 32, "return_sequences": true, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "unroll": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "name": "lstm_2", "go_backwards": true, "use_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "activation": "tanh", "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "units": 64, "return_sequences": true, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "unroll": false}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"recurrent_regularizer": null, "trainable": true, "name": "lstm_3", "go_backwards": true, "use_bias": true, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "activation": "tanh", "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "units": 128, "return_sequences": true, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "unroll": false}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "units": 1, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.0"}